app/Http/Controllers/BusBookingController.php

    public function findScheduleByRouteIDs(Request $request)
    {
        $schedule = Schedule::when($request->starting_point_id, function($q) use ($request){
            return $q->where('starting_point_id', $request->starting_point_id);
        })
        ->when($request->destination_id, function($q) use ($request){
            return $q->where('destination_id', $request->destination_id);
        })
        ->when($request->schedule_date, function($q) use ($request){
            return $q->where('schedule_date', $request->schedule_date);
        })
        ->with('bus')
        ->get();
---
select * from `schedules` where `starting_point_id` = '2' and `destination_id` = '3' and `schedule_date` = '2021-09-04' and `schedules`.`deleted_at` is null