app/Http/Controllers/BusController.php

select * from `buses`
---
    public function index()
    {
        $this->data['buses'] = Bus::all();