app/Http/Controllers/GoogleController.php

    public function handleGoogleCallback()
    {
        $user = Socialite::driver('google')->stateless()->user();
        $finduser = User::where('google_id', $user->id)->first();
---
select * from `users` where `google_id` = '106257955464077477441' and `users`.`deleted_at` is null limit 1