app/Http/Controllers/RoleController.php

    public function index()
    {
        $this->data['roles'] = Role::all();
---
select * from `roles`

    public function saveRequest($role, $request)
    {
        $role->name = $request->name;
        $role->save();
---
insert into `roles` (`name`, `updated_at`, `created_at`) values ('Tester', '2021-07-19 16:40:41', '2021-07-19 16:40:41')