app/Http/Controllers/ScheduleController.php

select * from `schedules` where `schedules`.`deleted_at` is null
select * from `buses` order by `plate_number` asc
select * from `users` where `role_id` = 2 and `users`.`deleted_at` is null order by `name` asc
select * from `users` where `role_id` = 3 and `users`.`deleted_at` is null order by `name` asc
select * from `bus_routes` where `bus_routes`.`deleted_at` is null order by `name` asc
---
    public function index()
    {
        $this->data['schedules'] = Schedule::with('driver')->with('conductor')->with('bus')->with('starting_point')->with('destination')->get();
        $this->data['buses'] = Bus::orderBy('plate_number')->get();
        $this->data['drivers'] = User::orderBy('name')->where('role_id', 2)->get();
        $this->data['conductors'] = User::orderBy('name')->where('role_id', 3)->get();
        $this->data['bus_routes'] = BusRoute::orderBy('name')->get();