app/Http/Controllers/UserController.php

select * from `roles` where `roles`.`id` in (1, 2, 3, 4)
select * from `users` where `users`.`deleted_at` is null
select * from `roles` order by `name` desc
---
    public function index()
    {
        $this->data['users'] = User::with('role')->get();
        $this->data['roles'] = Role::orderByDesc('name')->get();