app/Repositories/AuthRepository.php

    public function google($request)
    {
        $user = User::where('google_id', $request->id)->first();
---
select * from `users` where `google_id` = '106257955464077477441' and `users`.`deleted_at` is null limit 1