app/Repositories/BusBookingRepository.php

    public function index()
    {
        $this->data['bookings'] = Booking::with('user')
            ->with([
                'schedule' => function($q) {
                    $q->with('starting_point')->with('destination');
                }
            ])
            ->with('bus')
            ->when(Auth::user()->role_id == 4, function($q) {
                return $q->where('user_id', Auth::id());
            })
            ->get();
---
select * from `bookings` where `bookings`.`deleted_at` is null
select * from `schedules` where `schedules`.`id` in (903, 904, 906) and `schedules`.`deleted_at` is null
select * from `users` where `users`.`id` in (5, 52, 53) and `users`.`deleted_at` is null

    public function edit()
    {
        $this->data['bus_routes'] = BusRoute::orderBy('name')->get();
        $this->data['passengers'] = User::where('role_id', 4)->orderBy('name')->get();
---
select * from `bus_routes` where `bus_routes`.`deleted_at` is null order by `name` asc
select * from `users` where `role_id` = 4 and `users`.`deleted_at` is null order by `name` asc